[
  {
    "id": 1,
    "post": 1,
    "author": 1,
    "reply": null,
    "publication": "2019-02-19T14:40:00.000+04:00",
    "body": "Проект также выгоден? А выгоден ли он мне, человеку, который платит не очень большие, но всё-таки налоги? Этот момент в статьях очень часто упускается, а он важен."
  },
  {
    "id": 2,
    "post": 1,
    "author": 2,
    "reply": 1,
    "publication": "2019-02-19T14:44:00.000+04:00",
    "body": "Так тут пролетает НЛО и советует прятать голову в песок."
  },
  {
    "id": 3,
    "post": 1,
    "author": 3,
    "reply": 1,
    "publication": "2019-02-19T14:49:00.000+04:00",
    "body": "Мне этот проект выгоден. Довольно часто приходится бывать в деревнях, до которых большая четверка не дойдет скорее всего никогда. Звонил по таксофонам раз десять за всю жизнь, но пару раз они меня спасали (1 звонок пожарным, 1 звонок в скорую) — за эти два раза и гипотетические полтора раза спасения моих знакомых в будущем готов платить за эту систему оставшуюся жизнь. С другой стороны я вполне отдаю себе отчет, что деньги выделенные на проект будут разделены по правилу Паретто — 20% на сам проект, 80% — на смазку всех участвующий шестеренок государственной машины."
  },
  {
    "id": 4,
    "post": 1,
    "author": 4,
    "reply": 1,
    "publication": "2019-02-19T15:19:00.000+04:00",
    "body": "Половина — не очень большие налоги?"
  },
  {
    "id": 5,
    "post": 1,
    "author": 1,
    "reply": 4,
    "publication": "2019-02-19T21:00:00.000+04:00",
    "body": "Я имею ввиду абсолютную сумму, а не процент."
  },
  {
    "id": 6,
    "post": 1,
    "author": 5,
    "reply": null,
    "publication": "2019-02-19T14:45:00.000+04:00",
    "body": "Интересно, с этими играми в оповещение… никого не смущает, что годами в метро Питера в туннелях связь работает только у Мегафона и Йоты (хотя исходно кабель прокладывался для работы именно системы оповещения при ЧС, и часть средств была города) — хотя идея была в том, что Мега прокладывает, а потом пускает к кабелю других операторов? Блаженные, живут в своих мирах, с чем-то там борются, на что-то деньги выделяют!.. Картинка с таксофоном показательна: по мере развития сотовых сетей (как об этом докладывают сотовые операторы) все меньше мест, где связи нет вовсе. И таксофоны все чаще стоят просто так, хорошо, если работают и вообще годны. Так что вопрос будет не в установке на них просто динамиков системы оповещения, а еще и в оживлении многих их них. Мне так кажется, учения по ГО и ЧС дали бы больше, да и МЧС больше бы рада им была бы, но кто же спасателей-то послушает?"
  },
  {
    "id": 7,
    "post": 1,
    "author": 6,
    "reply": 6,
    "publication": "2019-02-19T14:57:00.000+04:00",
    "body": "A причем тут оповещение МЧС и сотовые в метро Питера?"
  },
  {
    "id": 8,
    "post": 1,
    "author": 5,
    "reply": 7,
    "publication": "2019-02-19T15:55:00.000+04:00",
    "body": "Считается, что в-случае-чего все юзеры получат СМС на тему того, что произошло. «Падайте и ползите налево». Идея была такая, под это мега получила право прокладывать кабель — туннель, как бы, ресурс не безлимитный."
  },
  {
    "id": 9,
    "post": 1,
    "author": 6,
    "reply": 8,
    "publication": "2019-02-19T16:09:00.000+04:00",
    "body": "Cтранно что это так считается, потому что: 1) в тоннеле есть оповещение через громкоговорители которые отлично слышно даже внутри поезда, и телефоны каждые x-метров (c указателями «телефон там->»); 2) в поезде есть громкая связь и машинист обязан людей проинструктировать по поводу нештатной ситуации. A писать чтото пассажирам в условиях паники, в стиле «я получил-он не получил omg мы все умрем» — это очень фиговый кейс."
  },
  {
    "id": 10,
    "post": 1,
    "author": 7,
    "reply": null,
    "publication": "2019-02-19T21:49:00.000+04:00",
    "body": "Между прочим, таксофоны уже год как дают возможность бесплатно звонить на местные городские номера, а также принимают входящие звонки, в т.ч. с таксофона на таксофон."
  },
  {
    "id": 11,
    "post": 2,
    "author": 1,
    "reply": null,
    "publication": "2019-02-06T12:18:00.000+04:00",
    "body": "«Выдерживает 15 падений с высоты 1 метр, что вдвое больше прошлого поколения». То есть ситуация, когда телефон падает как попало и с ним всё ок, а потом «мышка пробежала, хвостиком махнула..» и стекло становится картой метро Москвы — это не баг, а фича?"
  },
  {
    "id": 12,
    "post": 2,
    "author": 2,
    "reply": 11,
    "publication": "2019-02-06T12:47:00.000+04:00",
    "body": "Это ж не стрельба из рогатки по танковой броне. Бесследно не проходит, по всей видимости. Попробуйте проволоку сгибать-разгибать: сколько-то раз всё замечательно, а потом «ой!». Update: только что для проверки собственных слов поигрался с ножкой светодиода — выдержала ровно 15 сгибаний на 90 градусов."
  },
  {
    "id": 13,
    "post": 2,
    "author": 8,
    "reply": 12,
    "publication": "2019-02-06T12:54:00.000+04:00",
    "body": "Это вдвое больше, чем ножки светодиода предыдущего поколения?"
  },
  {
    "id": 14,
    "post": 2,
    "author": 2,
    "reply": 13,
    "publication": "2019-02-06T12:57:00.000+04:00",
    "body": "Специально для Вас и Науки пошарю дома по ящикам: где-то у меня были советские. Но ничего не могу обещать: переезд."
  },
  {
    "id": 15,
    "post": 2,
    "author": 7,
    "reply": 13,
    "publication": "2019-02-06T13:12:00.000+04:00",
    "body": "В 15 раз больше. В предыдущем поколении был smd светодиод/ :)"
  },
  {
    "id": 16,
    "post": 2,
    "author": 6,
    "reply": 13,
    "publication": "2019-02-06T14:42:00.000+04:00",
    "body": "На работе имеется пара пакетов советских светодиодов. Поломал 4 ножки. Вы, таки, будете смеяться, но они выдерживают 4-5 сгибаний на 90 градусов."
  },
  {
    "id": 17,
    "post": 2,
    "author": 2,
    "reply": 16,
    "publication": "2019-02-07T11:04:00.000+04:00",
    "body": "Спасибо, коллега!"
  },
  {
    "id": 18,
    "post": 2,
    "author": 5,
    "reply": null,
    "publication": "2019-02-06T12:57:00.000+04:00",
    "body": "Упасть с метра можно по разному. Упадет плоской стороной и 100 раз выдержит, упадет на угол и с первого раза у вас образуется Большой каньон на экране."
  },
  {
    "id": 19,
    "post": 2,
    "author": 1,
    "reply": 18,
    "publication": "2019-02-06T13:19:00.000+04:00",
    "body": "*задумчиво смотрит на сплющенные углы телефона* То есть осталось 15 div 2 — 2 = 5 падений…"
  },
  {
    "id": 20,
    "post": 2,
    "author": 4,
    "reply": null,
    "publication": "2019-02-07T14:27:00.000+04:00",
    "body": "Расходимся, короче. Будет как с аккумуляторами, каждый год в прессе пишут, что ученые университета Х разработали новую технологию, благодаря которой новые аккумы будут в N раз круче старых. Производство будет запущено через 1-2 года. И тишина."
  },
  {
    "id": 21,
    "post": 3,
    "author": 6,
    "reply": null,
    "publication": "2019-02-06T09:01:00.000+04:00",
    "body": "Сколько можно! Не надо учить программированию детей! Научите их пользоваться компьютерами! Разработчик ПО это она из десятков тысяч профессий и количественная доля менее 1%. А вот умение пользоваться компьютерами нужно уже 30-50% людей. Да и как можно научить программировать того кто не знает что можно сделать, а что нельзя сделать с помощью компьютера."
  },
  {
    "id": 22,
    "post": 3,
    "author": 7,
    "reply": 21,
    "publication": "2019-02-06T09:16:00.000+04:00",
    "body": "И по большому счёту программировать в начале можно учить без компьютера — что такое цикл, что такое ветвление можно объяснить на пальцах (и играх с другими детьми), заодно станет понятно что «программирование» — это не кнопки тыкать с зелёными отсветами на лице в тёмной комнате, а вещь более базовая, местами даже не связанная с компрьютерами (она про алгоритмы, а не про кнопки)."
  },
  {
    "id": 23,
    "post": 3,
    "author": 3,
    "reply": 22,
    "publication": "2019-02-06T09:46:00.000+04:00",
    "body": "И как любая абстрактная вещь почти никому не будет интересна без наглядной практики."
  },
  {
    "id": 24,
    "post": 3,
    "author": 8,
    "reply": 22,
    "publication": "2019-02-06T10:11:00.000+04:00",
    "body": "Боже спаси моего ребенка от такого преподавателя. От программирования без компьютера до резиновой женщины один шаг."
  },
  {
    "id": 25,
    "post": 3,
    "author": 1,
    "reply": null,
    "publication": "2019-02-06T09:49:00.000+04:00",
    "body": "у меня в 3 классе была такая же фигня как на картинках. «черепашка» на компьютерах ямаха, двигалась, оставляла за собой след. вполне нормальный ввод в логику."
  },
  {
    "id": 26,
    "post": 3,
    "author": 4,
    "reply": null,
    "publication": "2019-02-06T11:14:00.000+04:00",
    "body": "Ну это уж явно поинтереснее выглядит, чем «духовное краеведение» и прочее дремучее средневековье. Не совсем понятно, правда, почему в математику. Школьный курс математики все-таки не сильно связан с алгоритмами как таковыми. Гораздо логичнее было бы поставить в информатику, где юные отроки проходят начала алгебры логики и вот это вот всё. Но идея в целом довольно неплохая."
  },
  {
    "id": 27,
    "post": 4,
    "author": 5,
    "reply": null,
    "publication": "2019-02-05T23:15:00.000+04:00",
    "body": "– Учитель, я подобрал хороший пароль, которого не может быть в словарях. Инь Фу Во кивнул. – Я ввёл его в Гугле, – продолжал Сисадмин, – и убедился, что в Сети такого сочетания нет. – Теперь есть."
  },
  {
    "id": 28,
    "post": 4,
    "author": 6,
    "reply": null,
    "publication": "2019-02-06T15:03:00.000+04:00",
    "body": "Вообще-то стоило бы проверять не только пары email/password, но также просто email — если в утечке есть email, это уже достаточное основание для смены пароля, даже если он сам (пока) не утёк (что может произойти позже, если он был в качестве слабого хэша)."
  },
  {
    "id": 29,
    "post": 4,
    "author": 3,
    "reply": 28,
    "publication": "2019-02-06T18:07:00.000+04:00",
    "body": "Буквально на днях пришло письмо, примерно такого содержания: Привет, мы взломали твою почту и увели от туда кучу важной информации и фотографий личного характера, если не хотите что бы они попали в сеть заплатите нам 800 баксов. И ниже сама почта и пароль от нее, только пароль старый конечно уже. В принципе понятно на кого рассчитано."
  },
  {
    "id": 30,
    "post": 5,
    "author": 1,
    "reply": null,
    "publication": "2019-02-05T15:41:00.000+04:00",
    "body": "Спасибо, но нет."
  },
  {
    "id": 31,
    "post": 5,
    "author": 3,
    "reply": 30,
    "publication": "2019-02-06T08:44:00.000+04:00",
    "body": "Да уж, репутацию компания подмочила себе знатно и далеко не один раз. Самое обидное, как эта компания безжалостно локализует (уничтожает) зачастую неплохие mmorpg игры, вводя анальные донаты. И особая печаль это покупка vk :(. Моё мнение — к чему бы эта компания не превращалась, всё превращается в золото (говно)."
  },
  {
    "id": 32,
    "post": 5,
    "author": 2,
    "reply": null,
    "publication": "2019-02-05T15:43:00.000+04:00",
    "body": "Mail.ru и приватность это даже не смешно."
  },
  {
    "id": 33,
    "post": 5,
    "author": 6,
    "reply": 32,
    "publication": "2019-02-05T15:47:00.000+04:00",
    "body": "«Мэйлру», «безопасность» и «приватность» в одном приложении это так необычно… Прям чувствую, что не хватает двух маленьких звёздочек или они настолько малы, что их не видно."
  },
  {
    "id": 34,
    "post": 5,
    "author": 7,
    "reply": 32,
    "publication": "2019-02-05T16:08:00.000+04:00",
    "body": "Не знаю, я как в ленте увидел, меня повеселило."
  },
  {
    "id": 35,
    "post": 6,
    "author": 3,
    "reply": null,
    "publication": "2019-02-01T19:08:00.000+04:00",
    "body": "Ещё несколько лет подобных разработок и хранить секреты на полицейском допросе станет горааааздо труднее. А шпионов будут обучать не только держать рот на замке, но и контролировать внутренний диалог. Прям готовый сюжет для киберпанка…"
  },
  {
    "id": 36,
    "post": 6,
    "author": 6,
    "reply": null,
    "publication": "2019-02-01T20:43:00.000+04:00",
    "body": "Шустрая бурая лисица прыгает через ленивого пса, шустрая бурая лисица прыгает через ленивого пса..."
  },
  {
    "id": 37,
    "post": 6,
    "author": 1,
    "reply": null,
    "publication": "2019-02-01T21:36:00.000+04:00",
    "body": "Самое интересное начнется когда появятся гарнитуры для телефонов, толпы молчаливых людей, и когда их начнут прослушивать."
  },
  {
    "id": 38,
    "post": 6,
    "author": 5,
    "reply": 37,
    "publication": "2019-02-01T22:58:00.000+04:00",
    "body": "… и наказывать за мыслепреступления."
  },
  {
    "id": 39,
    "post": 6,
    "author": 3,
    "reply": 38,
    "publication": "2019-02-02T00:41:00.000+04:00",
    "body": "Наказывать неэффективно, лучше сразу ставить DPI-имплантант в ключевые точки мозга и блокировать всё запрещённое."
  },
  {
    "id": 40,
    "post": 7,
    "author": 2,
    "reply": null,
    "publication": "2019-01-30T08:49:00.000+04:00",
    "body": "Опросил вокруг себя людей в офисе, никто не знает, что он вообще существует. Налицо маркетинговый провал в объеме около 10 человек."
  },
  {
    "id": 41,
    "post": 7,
    "author": 3,
    "reply": 40,
    "publication": "2019-01-30T09:15:00.000+04:00",
    "body": "У нас больше половины знают о существовании (но большинство из них характеристиками даже не интересовалось). Владельцы айфона не собираются менять его, владельцы дешёвых китайцев тоже (разве что на таких же после смерти своих), даже владельцы винфона не собираются (не смотря на позицию МС), как и владельцы чуть менее бюджетных аппаратов на андроиде."
  },
  {
    "id": 42,
    "post": 7,
    "author": 4,
    "reply": 41,
    "publication": "2019-01-30T09:37:00.000+04:00",
    "body": "Тоже не собираюсь менять свою китайщину ради Алисы, которую придется выключать, а про майкрософт позиция позицией а Lumia 435 я буду вспоминать, как 3310, неубиваемый кирпеченок с невозможно точным GPS. Вижу использования яндекс фона только для стариков, но им тогда и цену надо было в тысяч 8 и без особых характеристик."
  },
  {
    "id": 43,
    "post": 7,
    "author": 5,
    "reply": null,
    "publication": "2019-01-30T09:09:00.000+04:00",
    "body": "Установил себе на телефон приложение Яндекс, чтобы оно помогало мне фильтровать спам-звонки, отображая что за организация мне звонит. В итоге, само приложение заспамило меня сообщениями типа «вы только что были в столовой. Нам важно ваше мнение о ней». Удалил приложение. Зачем мне телефон, где такое встроено по-умолчанию?"
  },
  {
    "id": 44,
    "post": 7,
    "author": 3,
    "reply": 43,
    "publication": "2019-01-30T09:28:00.000+04:00",
    "body": "По этой же причине отказался от яндекс карт: у меня хром постоянно спрашивал не хочу ли я установить поиск яндекса по умолчанию (раза после 10 решил просто удалить весь яндекс с телефона)."
  },
  {
    "id": 45,
    "post": 7,
    "author": 1,
    "reply": null,
    "publication": "2019-01-30T09:10:00.000+04:00",
    "body": "А должен был? Тут еще какая история… мне кажется, у нас в стране сложилось довольно негативное впечатление о Российско-брендовых (ноунейм китайских) поделках за 2к-3к, на которых даже звонить тяжко. Всякие там операторские телефоны, на которых не работает их собственное! же приложение, ибо в теле недостаточно оперативы. Не имею ничего против яндекс версии (ввиду положительного отношения к их веб-сервисам), но бороться с таким сложившимся общественным мнением надо не только ценой в 18к, иначе не взлетит."
  },
  {
    "id": 46,
    "post": 8,
    "author": 3,
    "reply": null,
    "publication": "2019-01-29T12:37:00.000+04:00",
    "body": "Новая функция «архивирования» сообщений - с такой подачей, очень похожа на установку флажка «копать здесь»."
  },
  {
    "id": 47,
    "post": 8,
    "author": 4,
    "reply": 46,
    "publication": "2019-01-29T13:01:00.000+04:00",
    "body": "Особенно, если вспомнить ситуацию, когда девушку судили за контент в закрытом альбоме."
  },
  {
    "id": 48,
    "post": 8,
    "author": 6,
    "reply": 47,
    "publication": "2019-01-30T08:00:00.000+04:00",
    "body": "После этой истории сразу же почистил альбомы"
  },
  {
    "id": 49,
    "post": 8,
    "author": 8,
    "reply": null,
    "publication": "2019-01-29T12:42:00.000+04:00",
    "body": "Не особо понятно, сделал запись и потом заархивировал её, теперь запись никто не видит, я тоже, зачем тогда я её делал? При этом заархивированная запись все равно принадлежит мне и поскольку я не ввожу никакой пароль, то значит и разархивировать её тоже можно без моего ведома. То есть это функция скорее для наведения порядка в собственных записях, причем тут органы всякие понять не смог."
  },
  {
    "id": 50,
    "post": 8,
    "author": 2,
    "reply": 49,
    "publication": "2019-01-29T14:46:00.000+04:00",
    "body": "В статье написано что автор видит архивные записи"
  }
]